scriptTesting/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       160560;
    }
    outlet
    {
        type            patch;
        nFaces          45;
        startFace       160650;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1395;
        startFace       160695;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1350;
        startFace       162090;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          162000;
        startFace       163440;
    }
)

// ************************************************************************* //
