scriptTesting/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0];

internalField   uniform (0 0 0);

boundaryField
{
/*        type            fixedValue;*/
/*        value           uniform (-1 0 0);*/
/*        type            pressureInletOutletVelocity;*/
/*        value           uniform (-1 0 0);//$internalField;*/
    inlet
    {
/*      type         uniformFixedValue; */
/*      uniformValue csvFile; */
/*      uniformValueCoeffs */
/*      { */
/*          nHeaderLine         0;              // number of header lines */
/*          refColumn           0;              // time column index */
/*          componentColumns    (1 2 3);            // data column index */
/*          separator           ",";            // optional (defaults to ”,”) */
/*          mergeSeparators     no;             // merge multiple separators */
/*          fileName            "inletVel.csv"; */
/*        }*/
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }

    outlet
    {
/*        type            pressureInletOutletVelocity;*/
/*        value           $internalField;*/
        type            pressureInletOutletVelocity;
        phi             phi;
        tangentialVelocity uniform (0 0 0);
        value           $internalField;
    }

    upperWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
