scriptTesting/system/fvSolution_stage3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaSubCycles 2;
        nAlphaCorr      2;
        cAlpha          1.5;

        MULESCorr       yes;
        //nLimiterIter    8;
        nLimiterIter    8;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        maxIter         10;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
/*        preconditioner*/
/*        {*/
/*            solver          GAMG;*/
/*            tolerance       1e-10;*/
/*            relTol          0.01;*/
/*            smoother        GaussSeidel;*/
/*            cacheAgglomeration true;*/
/*            // use sqrt(#cells))*/
/*            nCellsInCoarsestLevel 500;*/
/*            nPreSweeps 1;*/
/*            nPostSweeps 2;*/
/*            postSweepsLevelMultiplier 2;*/
/*            maxPostSweeps 4;*/
/*            nFinestSweeps 2;*/
/*            agglomerator    faceAreaPair;*/
/*            mergeLevels     1;*/
/*        }*/
        //tolerance       1e-05;
        tolerance       1e-7;
        relTol          0;
        //maxIter         20;
    }

    p_rgh
    {
        solver          PCG; 
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        maxIter         1000;
/*        solver          GAMG;*/
/*        tolerance       1e-10;*/
/*        relTol          0.01;*/
/*        smoother        GaussSeidel;*/
/*        cacheAgglomeration true;*/
/*        // use sqrt(#cells))*/
/*        nCellsInCoarsestLevel 500;*/
/*        nPreSweeps 2;*/
/*        nPostSweeps 2;*/
/*        postSweepsLevelMultiplier 2;*/
/*        maxPostSweeps 4;*/
/*        nFinestSweeps 2;*/
/*        agglomerator    faceAreaPair;*/
/*        mergeLevels     1;*/
    }

    p_rghFinal
    {
        solver          PCG; 
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
        maxIter         1000;
/*        solver          GAMG;*/
/*        tolerance       1e-10;*/
/*        relTol          0.01;*/
/*        smoother        GaussSeidel;*/
/*        cacheAgglomeration true;*/
/*        // use sqrt(#cells))*/
/*        nCellsInCoarsestLevel 500;*/
/*        nPreSweeps 2;*/
/*        nPostSweeps 2;*/
/*        postSweepsLevelMultiplier 2;*/
/*        maxPostSweeps 4;*/
/*        nFinestSweeps 2;*/
/*        agglomerator    faceAreaPair;*/
/*        mergeLevels     1;*/
    }

    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "(U|T|k|B|nuTilda|espilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        nSweeps         1;
    }

    "(U|T|k|B|nuTilda|espilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    Phi
    {
        $p_rgh;
        relTol          0;
    };
}

potentialFlow
{
    nNonOrthogonalCorrectors   8;
}

PIMPLE
{
    momentumPredictor           no;
    // Outer Loops ( Pressure - Momentum Correction )
    nOuterCorrectors            1000;
    // Inner Loops ( Pressure Correction )
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    consistent      yes;
    turbOnFinalIterOnly true;

residualControl
{
        "alpha.*"
        {
        //relTol 1e-1;
        relTol 0;
        tolerance 1e-3;
        //tolerance 1e-4;
        }
        "p.*"
        {
        //relTol 0;
        relTol 0;
        //tolerance 5e-5;
        tolerance 1e-6;
        }
        "U.*"
        {
        //relTol 0;
        relTol 0;
        tolerance 1e-8;
        }
}
relaxationFactors
{

    fields
    {
        p                   0.3;
        pFinal                1;
        "alpha.*"       0.6;
    }
    equations
    {
        "(T|B|nuTilda)"           0.6;
        U                   0.7;
        k                   0.6;
        epsilon             0.6;
        UFinal                1;
        kFinal                1;
        epsilonFinal          1;
        
    }
}

// ************************************************************************* //
